{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "Embedding",
          "config": {
            "batch_input_shape": [null, 100],
            "input_dim": 10000,
            "input_length": 100,
            "output_dim": 32,
            "name": "embedding"
          }
        },
        {
          "class_name": "LSTM",
          "config": {
            "units": 64,
            "name": "lstm"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 1,
            "activation": "sigmoid",
            "name": "dense"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "embedding/embeddings",
          "shape": [10000, 32],
          "dtype": "float32"
        },
        {
          "name": "lstm/lstm_cell/kernel",
          "shape": [32, 256],
          "dtype": "float32"
        },
        {
          "name": "lstm/lstm_cell/recurrent_kernel",
          "shape": [64, 256],
          "dtype": "float32"
        },
        {
          "name": "lstm/lstm_cell/bias",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "dense/kernel",
          "shape": [64, 1],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [1],
          "dtype": "float32"
        }
      ]
    }
  ]
}